[
  {
    "company": "Ultraverse NFT WORLD",
    "role": "Software Developer (Intern)",
    "resps": [
      "Enhanced User Engagement: Developed and integrated features like Hot Collections, New Items, Top Sellers, Author Page, and Item Details, which enriched the platform's content offerings and provided users with more personalized and relevant information, leading to increased user interaction.",
      "Enhanced User Experience: Implemented animations, countdowns, and carousels that created a more dynamic and engaging user interface, leading to a smoother and more interactive browsing experience for users.",
      "Real-Time Data Integration: Utilized APIs to provide real-time data updates, improving the relevance and timeliness of displayed content.",
      "Streamlined Development Workflow: Managed project development with GitHub, ensuring smooth collaboration by maintaining separate branches for each feature."
    ],
    "date": "May 2024 - July 2024"
  },
  {
    "company": "Patch To Life-(sold company)",
    "role": "Founder & Lead Developer",
    "resps": [
      "Built a Profitable Business: Founded and scaled an e-commerce business, leading to a successful exit by implementing a robust front-end architecture using HTML5, CSS, and JavaScript, resulting in a seamless user experience.",
      "Increased Operational Efficiency: Utilized Firebase for backend services, including user authentication and real-time database management, reducing customer support response times ",
      "Boosted Organic Traffic: Integrated SEO best practices that increased search engine visibility, driving a rise in organic traffic.",
      "Ensured High Availability: Implemented backend monitoring for UI uptime with automated email alerts, maintaining a 99.9% uptime and enhancing customer satisfaction.",
      "Effective Product Marketing: Developed dynamic carousels and countdowns, particularly optimized for mobile devices, significantly improving product visibility and sales conversion rates.",
      "Successfully scaled the business, resulting in a profitable exit."
      
    ],
    "date": "Oct 2019 - Nov 2023"
  }
]
